Revit 2027 API
CriticalPathCollector.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<MEPNetworkSegmentId> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of MEPNetworkSegmentId)
public:
virtual IEnumerator<MEPNetworkSegmentId^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<MEPNetworkSegmentId>
override GetEnumerator : unit -> IEnumerator<MEPNetworkSegmentId>
Return Value
IEnumerator<MEPNetworkSegmentId>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace